TO-BE/DotGraph/process.dot
digraph G {
rankdir=TD;
"E0 \nRequirement \n (Jira)" [style=filled, fillcolor="#60a5fa", shape=box];
"E1 \n Requirements to BRS \n (Confluence) " [style=filled, fillcolor="#60a5fa", shape=box];
"E2 \n BRS to SRS \n (Confluence) " [style=filled, fillcolor="#60a5fa", shape=box];
"E3 \n BRS to SRS \n (Confluence) " [style=filled, fillcolor="#60a5fa", shape=box];
"E4 \n IT handbook to SRS \n (Confluence) " [style=filled, fillcolor="#60a5fa", shape=box];
"E5 \n BRS to SRS \n (Confluence) " [style=filled, fillcolor="#60a5fa", shape=box];
"E6 \n SRS to SRS \n (Confluence) " [style=filled, fillcolor="#60a5fa", shape=box];
"E7 \n SRS to SRS \n (Confluence) " [style=filled, fillcolor="#60a5fa", shape=box];
"E8 \n BRS/SRS to BRS/SRS \n (Confluence) " [style=filled, fillcolor="#60a5fa", shape=box];
"E9 \n Requirements to Requirements \n (Jira) " [style=filled, fillcolor="#60a5fa", shape=box];
"E10 \n Requirements to SRS \n (Jira) " [style=filled, fillcolor="#60a5fa", shape=box];
"E11 \n Requirements to SRS \n (Confluence) " [style=filled, fillcolor="#60a5fa", shape=box];
"E12 \n Requirements to SRS \n (Confluence) " [style=filled, fillcolor="#60a5fa", shape=box];
"E13 \n Requirements to nan \n (Confluence) " [style=filled, fillcolor="#60a5fa", shape=box];
"E14 \n Requirements to Test case \n (Jbehave) " [style=filled, fillcolor="#60a5fa", shape=box];
"E15 \n Requirements to Test case \n (Jbehave) " [style=filled, fillcolor="#60a5fa", shape=box];
"E16 \n Test case to Test script \n (Jbehave) " [style=filled, fillcolor="#60a5fa", shape=box];
"E17 \n Test case to Test script \n (Jbehave) " [style=filled, fillcolor="#60a5fa", shape=box];
"E18 \n Test case to Requirements \n (Jira) " [style=filled, fillcolor="#60a5fa", shape=box];
"E19 \n Requirements to Infra as code \n (Puppet) " [style=filled, fillcolor="#60a5fa", shape=box];
"E20 \n Requirements to Infra as code \n (Puppet) " [style=filled, fillcolor="#60a5fa", shape=box];
"E21 \n Template to Environment \n (Puppet) " [style=filled, fillcolor="#60a5fa", shape=box];
"E22 \n Template to Infra as code \n (Puppet) " [style=filled, fillcolor="#60a5fa", shape=box];
"E23 \n Template to Service request \n (ServiceNow) " [style=filled, fillcolor="#60a5fa", shape=box];
"E24 \n Service request to Infra as code \n (ServiceNow) " [style=filled, fillcolor="#60a5fa", shape=box];
"E25 \n Infra as code to Environment \n (Puppet) " [style=filled, fillcolor="#60a5fa", shape=box];
"E26 \n Environment to Service request \n (ServiceNow) " [style=filled, fillcolor="#60a5fa", shape=box];
"E27 \n Requirements to Code \n (Text editor (UNIX/LINUX)) " [style=filled, fillcolor="#60a5fa", shape=box];
"E28 \n Design to Code \n (Flyway) " [style=filled, fillcolor="#60a5fa", shape=box];
"E29 \n Code to Code \n (SonarQube) " [style=filled, fillcolor="#60a5fa", shape=box];
"E30 \n Code to Code \n (GitHub / GitLab) " [style=filled, fillcolor="#60a5fa", shape=box];
"E31 \n Code to Code \n (Flyway) " [style=filled, fillcolor="#60a5fa", shape=box];
"E32 \n Code to Code \n (Maven) " [style=filled, fillcolor="#60a5fa", shape=box];
"E33 \n Code to Test result \n (Selenium) " [style=filled, fillcolor="#60a5fa", shape=box];
"E34 \n Code to Test result \n (Selenium) " [style=filled, fillcolor="#60a5fa", shape=box];
"E35 \n Service request to Environment \n (ServiceNow) " [style=filled, fillcolor="#60a5fa", shape=box];
"E36 \n Requirements to Test case \n (Jbehave) " [style=filled, fillcolor="#60a5fa", shape=box];
"E37 \n Test case to Test script \n (Selenium) " [style=filled, fillcolor="#60a5fa", shape=box];
"E38 \n Test case to Test script \n (Selenium) " [style=filled, fillcolor="#60a5fa", shape=box];
"E39 \n Test case to Test script \n (Jmeter) " [style=filled, fillcolor="#60a5fa", shape=box];
"E40 \n Test case to Test script \n (Jmeter) " [style=filled, fillcolor="#60a5fa", shape=box];
"E41 \n Test script to Test result \n (Selenium) " [style=filled, fillcolor="#60a5fa", shape=box];
"E42 \n Test case to Test result \n (Selenium) " [style=filled, fillcolor="#60a5fa", shape=box];
"E43 \n Test script to Test result \n (Jmeter) " [style=filled, fillcolor="#60a5fa", shape=box];
"E44 \n Test case to Test result \n (Jmeter) " [style=filled, fillcolor="#60a5fa", shape=box];
"E45 \n Test result to Defect \n (Jira) " [style=filled, fillcolor="#60a5fa", shape=box];
"E46 \n Defect to Checklist \n (Jira) " [style=filled, fillcolor="#60a5fa", shape=box];
"E47 \n Defect to Code \n (Text editor (UNIX/LINUX)) " [style=filled, fillcolor="#60a5fa", shape=box];
"E48 \n Defect to Code \n (Jira) " [style=filled, fillcolor="#60a5fa", shape=box];
"E49 \n Test result to Checklist \n (Jira) " [style=filled, fillcolor="#60a5fa", shape=box];
"E50 \n Requirements to Release plan \n (Jira) " [style=filled, fillcolor="#60a5fa", shape=box];
"E51 \n Requirements to Release plan \n (Jira) " [style=filled, fillcolor="#60a5fa", shape=box];
"E52 \n Service request to Code \n (XL Deploy) " [style=filled, fillcolor="#60a5fa", shape=box];
"E53 \n Service request to Code \n (XL Deploy) " [style=filled, fillcolor="#60a5fa", shape=box];
"E54 \n Service request to Code \n (XL Deploy) " [style=filled, fillcolor="#60a5fa", shape=box];
"E55 \n Service request to Code \n (XL Deploy) " [style=filled, fillcolor="#60a5fa", shape=box];
"E56 \n Service request to Code \n (XL Deploy) " [style=filled, fillcolor="#60a5fa", shape=box];
"E57 \n Service request to Code \n (XL Deploy) " [style=filled, fillcolor="#60a5fa", shape=box];
"E58 \n Service request to Code \n (XL Deploy) " [style=filled, fillcolor="#60a5fa", shape=box];
"E59 \n Service request to Code \n (XL Deploy) " [style=filled, fillcolor="#60a5fa", shape=box];
"E60 \n Code to Report \n (OverOps) " [style=filled, fillcolor="#60a5fa", shape=box];
"E0 \nRequirement \n (Jira)" -> "E1 \n Requirements to BRS \n (Confluence) " [label="A1 \n 5.0,5.0 (0) \n Business"];
"E1 \n Requirements to BRS \n (Confluence) " -> "E2 \n BRS to SRS \n (Confluence) " [label="A2 \n 3.0,2.0 (5.0) \n ITLead"];
"E1 \n Requirements to BRS \n (Confluence) " -> "E3 \n BRS to SRS \n (Confluence) " [label="A4 \n 2.0,2.0 (5.0) \n ITLead"];
"E2 \n BRS to SRS \n (Confluence) " -> "E4 \n IT handbook to SRS \n (Confluence) " [label="A16 \n 1.0,1.0 (8.0) \n Ops-Rel"];
"E2 \n BRS to SRS \n (Confluence) " -> "E5 \n BRS to SRS \n (Confluence) " [label="A21 \n 3.0,3.0 (8.0) \n ITLead"];
"E3 \n BRS to SRS \n (Confluence) " -> "E5 \n BRS to SRS \n (Confluence) " [label="A21(A) \n 3.0,3.0 (7.0) \n ITLead"];
"E5 \n BRS to SRS \n (Confluence) " -> "E6 \n SRS to SRS \n (Confluence) " [label="A22 \n 2.0,2.0 (11.0) \n Architect"];
"E5 \n BRS to SRS \n (Confluence) " -> "E7 \n SRS to SRS \n (Confluence) " [label="A24 \n 2.0,2.0 (11.0) \n ITLead"];
"E6 \n SRS to SRS \n (Confluence) " -> "E7 \n SRS to SRS \n (Confluence) " [label="A24(A) \n 2.0,2.0 (13.0) \n ITLead"];
"E7 \n SRS to SRS \n (Confluence) " -> "E8 \n BRS/SRS to BRS/SRS \n (Confluence) " [label="A25 \n 0.25,0.25 (15.0) \n ITLead"];
"E7 \n SRS to SRS \n (Confluence) " -> "E9 \n Requirements to Requirements \n (Jira) " [label="A29 \n 1.0,1.0 (15.0) \n ITLead"];
"E9 \n Requirements to Requirements \n (Jira) " -> "E10 \n Requirements to SRS \n (Jira) " [label="A31 \n 1.0,1.0 (16.0) \n ITLead"];
"E9 \n Requirements to Requirements \n (Jira) " -> "E11 \n Requirements to SRS \n (Confluence) " [label="A34 \n 3.0,2.0 (16.0) \n Dev (incl. QA)"];
"E9 \n Requirements to Requirements \n (Jira) " -> "E12 \n Requirements to SRS \n (Confluence) " [label="A36 \n 1.5,1.5 (16.0) \n Dev (incl. QA)"];
"E11 \n Requirements to SRS \n (Confluence) " -> "E13 \n Requirements to nan \n (Confluence) " [label="A39 \n 2.0,2.0 (19.0) \n QA"];
"E12 \n Requirements to SRS \n (Confluence) " -> "E13 \n Requirements to nan \n (Confluence) " [label="A39(A) \n 2.0,2.0 (17.5) \n QA"];
"E13 \n Requirements to nan \n (Confluence) " -> "E14 \n Requirements to Test case \n (Jbehave) " [label="A40 \n 2.0,1.0 (21.0) \n QA"];
"E13 \n Requirements to nan \n (Confluence) " -> "E15 \n Requirements to Test case \n (Jbehave) " [label="A42 \n 1.5,0.5 (21.0) \n QA"];
"E14 \n Requirements to Test case \n (Jbehave) " -> "E16 \n Test case to Test script \n (Jbehave) " [label="A46 \n 2.0,1.0 (23.0) \n QA"];
"E15 \n Requirements to Test case \n (Jbehave) " -> "E16 \n Test case to Test script \n (Jbehave) " [label="A46(A) \n 2.0,1.0 (22.5) \n QA"];
"E14 \n Requirements to Test case \n (Jbehave) " -> "E17 \n Test case to Test script \n (Jbehave) " [label="A47 \n 2.0,1.0 (23.0) \n QA"];
"E15 \n Requirements to Test case \n (Jbehave) " -> "E17 \n Test case to Test script \n (Jbehave) " [label="A47(A) \n 2.0,1.0 (22.5) \n QA"];
"E6 \n SRS to SRS \n (Confluence) " -> "E18 \n Test case to Requirements \n (Jira) " [label="A50 \n 1.0,0.5 (13.0) \n QA"];
"E9 \n Requirements to Requirements \n (Jira) " -> "E18 \n Test case to Requirements \n (Jira) " [label="A50(A) \n 1.0,0.5 (16.0) \n QA"];
"E2 \n BRS to SRS \n (Confluence) " -> "E19 \n Requirements to Infra as code \n (Puppet) " [label="A98 \n 1.0,1.0 (8.0) \n Ops-Rel"];
"E3 \n BRS to SRS \n (Confluence) " -> "E19 \n Requirements to Infra as code \n (Puppet) " [label="A98(A) \n 1.0,1.0 (7.0) \n Ops-Rel"];
"E19 \n Requirements to Infra as code \n (Puppet) " -> "E20 \n Requirements to Infra as code \n (Puppet) " [label="A106 \n 0.5,0.5 (9.0) \n DevOps lead"];
"E24 \n Service request to Infra as code \n (ServiceNow) " -> "E21 \n Template to Environment \n (Puppet) " [label="A113 \n 0.01,0.01 (10.25) \n Ops-Infra"];
"E19 \n Requirements to Infra as code \n (Puppet) " -> "E22 \n Template to Infra as code \n (Puppet) " [label="A115 \n 0.5,0.5 (9.0) \n Ops-Rel"];
"E22 \n Template to Infra as code \n (Puppet) " -> "E23 \n Template to Service request \n (ServiceNow) " [label="A127 \n 0.25,0.0 (9.5) \n Dev (incl. QA)"];
"E23 \n Template to Service request \n (ServiceNow) " -> "E24 \n Service request to Infra as code \n (ServiceNow) " [label="A128 \n 0.5,0.5 (9.75) \n Ops-Infra"];
"E24 \n Service request to Infra as code \n (ServiceNow) " -> "E25 \n Infra as code to Environment \n (Puppet) " [label="A136 \n 0.01,0.0 (10.25) \n Ops-Infra"];
"E35 \n Service request to Environment \n (ServiceNow) " -> "E25 \n Infra as code to Environment \n (Puppet) " [label="A136(A) \n 0.01,0.0 (10.25) \n Ops-Infra"];
"E21 \n Template to Environment \n (Puppet) " -> "E26 \n Environment to Service request \n (ServiceNow) " [label="A164 \n 0.25,0.1 (10.26) \n Dev (incl. QA)"];
"E25 \n Infra as code to Environment \n (Puppet) " -> "E26 \n Environment to Service request \n (ServiceNow) " [label="A164(A) \n 0.25,0.1 (10.26) \n Dev (incl. QA)"];
"E26 \n Environment to Service request \n (ServiceNow) " -> "E27 \n Requirements to Code \n (Text editor (UNIX/LINUX)) " [label="A206 \n 5.0,3.5 (10.51) \n Dev (incl. QA)"];
"E26 \n Environment to Service request \n (ServiceNow) " -> "E28 \n Design to Code \n (Flyway) " [label="A212 \n 2.5,2.0 (10.51) \n Dev (incl. QA)"];
"E27 \n Requirements to Code \n (Text editor (UNIX/LINUX)) " -> "E29 \n Code to Code \n (SonarQube) " [label="A226 \n 0.5,0.25 (15.51) \n Dev (incl. QA)"];
"E29 \n Code to Code \n (SonarQube) " -> "E30 \n Code to Code \n (GitHub / GitLab) " [label="A229 \n 0.25,0.25 (16.01) \n Dev (incl. QA)"];
"E28 \n Design to Code \n (Flyway) " -> "E31 \n Code to Code \n (Flyway) " [label="A232 \n 0.25,0.25 (13.01) \n Dev (incl. QA)"];
"E30 \n Code to Code \n (GitHub / GitLab) " -> "E32 \n Code to Code \n (Maven) " [label="A245 \n 0.5,0.25 (16.26) \n Dev (incl. QA)"];
"E30 \n Code to Code \n (GitHub / GitLab) " -> "E33 \n Code to Test result \n (Selenium) " [label="A258 \n 0.5,0.25 (16.26) \n Dev (incl. QA)"];
"E31 \n Code to Code \n (Flyway) " -> "E34 \n Code to Test result \n (Selenium) " [label="A260 \n 0.5,0.25 (13.26) \n Dev (incl. QA)"];
"E23 \n Template to Service request \n (ServiceNow) " -> "E35 \n Service request to Environment \n (ServiceNow) " [label="A273 \n 0.5,0.25 (9.75) \n QA"];
"E13 \n Requirements to nan \n (Confluence) " -> "E36 \n Requirements to Test case \n (Jbehave) " [label="A274 \n 3.0,2.5 (21.0) \n QA"];
"E16 \n Test case to Test script \n (Jbehave) " -> "E37 \n Test case to Test script \n (Selenium) " [label="A279 \n 2.0,1.5 (25.0) \n QA"];
"E17 \n Test case to Test script \n (Jbehave) " -> "E38 \n Test case to Test script \n (Selenium) " [label="A280 \n 2.0,1.5 (25.0) \n QA"];
"E16 \n Test case to Test script \n (Jbehave) " -> "E39 \n Test case to Test script \n (Jmeter) " [label="A283 \n 0.5,0.5 (25.0) \n QA"];
"E18 \n Test case to Requirements \n (Jira) " -> "E39 \n Test case to Test script \n (Jmeter) " [label="A283(A) \n 0.5,0.5 (17.0) \n QA"];
"E17 \n Test case to Test script \n (Jbehave) " -> "E40 \n Test case to Test script \n (Jmeter) " [label="A284 \n 0.5,0.5 (25.0) \n QA"];
"E18 \n Test case to Requirements \n (Jira) " -> "E40 \n Test case to Test script \n (Jmeter) " [label="A284(A) \n 0.5,0.5 (17.0) \n QA"];
"E37 \n Test case to Test script \n (Selenium) " -> "E41 \n Test script to Test result \n (Selenium) " [label="A305 \n 0.5,0.0 (27.0) \n QA"];
"E38 \n Test case to Test script \n (Selenium) " -> "E42 \n Test case to Test result \n (Selenium) " [label="A306 \n 1.5,0.5 (27.0) \n QA"];
"E39 \n Test case to Test script \n (Jmeter) " -> "E43 \n Test script to Test result \n (Jmeter) " [label="A309 \n 0.25,0.0 (25.5) \n QA"];
"E40 \n Test case to Test script \n (Jmeter) " -> "E44 \n Test case to Test result \n (Jmeter) " [label="A310 \n 0.25,0.0 (25.5) \n QA"];
"E41 \n Test script to Test result \n (Selenium) " -> "E45 \n Test result to Defect \n (Jira) " [label="A329 \n 0.5,0.25 (27.5) \n QA"];
"E42 \n Test case to Test result \n (Selenium) " -> "E45 \n Test result to Defect \n (Jira) " [label="A329(A) \n 0.5,0.25 (28.5) \n QA"];
"E43 \n Test script to Test result \n (Jmeter) " -> "E45 \n Test result to Defect \n (Jira) " [label="A329(B) \n 0.5,0.25 (25.75) \n QA"];
"E44 \n Test case to Test result \n (Jmeter) " -> "E45 \n Test result to Defect \n (Jira) " [label="A329(C) \n 0.5,0.25 (25.75) \n QA"];
"E45 \n Test result to Defect \n (Jira) " -> "E46 \n Defect to Checklist \n (Jira) " [label="A330 \n 0.25,0.25 (29.0) \n ITLead"];
"E46 \n Defect to Checklist \n (Jira) " -> "E47 \n Defect to Code \n (Text editor (UNIX/LINUX)) " [label="A332 \n 1.0,0.5 (29.25) \n Dev (incl. QA)"];
"E47 \n Defect to Code \n (Text editor (UNIX/LINUX)) " -> "E48 \n Defect to Code \n (Jira) " [label="A333 \n 0.5,0.5 (30.25) \n Dev (incl. QA)"];
"E48 \n Defect to Code \n (Jira) " -> "E49 \n Test result to Checklist \n (Jira) " [label="A334 \n 1.0,0.5 (30.75) \n QA"];
"E2 \n BRS to SRS \n (Confluence) " -> "E50 \n Requirements to Release plan \n (Jira) " [label="A335 \n 1.0,1.0 (8.0) \n Ops-Rel"];
"E3 \n BRS to SRS \n (Confluence) " -> "E50 \n Requirements to Release plan \n (Jira) " [label="A335(A) \n 1.0,1.0 (7.0) \n Ops-Rel"];
"E50 \n Requirements to Release plan \n (Jira) " -> "E51 \n Requirements to Release plan \n (Jira) " [label="A336 \n 3.0,3.0 (9.0) \n Ops-Rel"];
"E49 \n Test result to Checklist \n (Jira) " -> "E52 \n Service request to Code \n (XL Deploy) " [label="A347 \n 1.0,1.0 (31.75) \n Ops-Rel"];
"E49 \n Test result to Checklist \n (Jira) " -> "E53 \n Service request to Code \n (XL Deploy) " [label="A348 \n 1.0,0.5 (31.75) \n Ops-Rel"];
"E49 \n Test result to Checklist \n (Jira) " -> "E54 \n Service request to Code \n (XL Deploy) " [label="A352 \n 1.0,0.5 (31.75) \n Ops-Rel"];
"E52 \n Service request to Code \n (XL Deploy) " -> "E54 \n Service request to Code \n (XL Deploy) " [label="A352(A) \n 1.0,0.5 (32.75) \n Ops-Rel"];
"E49 \n Test result to Checklist \n (Jira) " -> "E55 \n Service request to Code \n (XL Deploy) " [label="A354 \n 1.0,0.5 (31.75) \n Ops-Rel"];
"E53 \n Service request to Code \n (XL Deploy) " -> "E55 \n Service request to Code \n (XL Deploy) " [label="A354(A) \n 1.0,0.5 (32.75) \n Ops-Rel"];
"E54 \n Service request to Code \n (XL Deploy) " -> "E56 \n Service request to Code \n (XL Deploy) " [label="A363 \n 1.0,1.0 (33.75) \n Ops-Rel"];
"E55 \n Service request to Code \n (XL Deploy) " -> "E57 \n Service request to Code \n (XL Deploy) " [label="A364 \n 1.0,1.0 (33.75) \n Ops-Rel"];
"E56 \n Service request to Code \n (XL Deploy) " -> "E58 \n Service request to Code \n (XL Deploy) " [label="A366 \n 1.0,0.5 (34.75) \n Ops-Rel"];
"E60 \n Code to Report \n (OverOps) " -> "E58 \n Service request to Code \n (XL Deploy) " [label="A366(A) \n 1.0,0.5 (34.25) \n Ops-Rel"];
"E57 \n Service request to Code \n (XL Deploy) " -> "E59 \n Service request to Code \n (XL Deploy) " [label="A368 \n 1.0,0.5 (34.75) \n Ops-Rel"];
"E60 \n Code to Report \n (OverOps) " -> "E59 \n Service request to Code \n (XL Deploy) " [label="A368(A) \n 1.0,0.5 (34.25) \n Ops-Rel"];
"E54 \n Service request to Code \n (XL Deploy) " -> "E60 \n Code to Report \n (OverOps) " [label="A377 \n 0.5,0.5 (33.75) \n Ops-Rel"];
"E55 \n Service request to Code \n (XL Deploy) " -> "E60 \n Code to Report \n (OverOps) " [label="A377(A) \n 0.5,0.5 (33.75) \n Ops-Rel"];
}
